#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time    : 19-1-12 上午9:56
# @Author  : yangsen
# @Mail    : 0@keepangry.com
# @File    : dev_dataset.py
# @Software: PyCharm

origin_data = [
    "我们 是 共产主义 的 接班人。",
    "我 爱 北京 天安门。"
]

train_data = [
    [
        ('我', 'B'),
        ('们', 'E'),
        ('是', 'S'),
        ('共', 'B'),
        ('产', 'M'),
        ('主', 'M'),
        ('义', 'E'),
        ('的', 'S'),
        ('接', 'B'),
        ('班', 'M'),
        ('人', 'E'),
        ('。', 'S'),
    ],
    [
        ('我', 'S'),
        ('爱', 'S'),
        ('北', 'B'),
        ('京', 'E'),
        ('天', 'B'),
        ('安', 'M'),
        ('门', 'E'),
        ('。', 'S'),
    ],
]

"""
# U00:%x[-2,0]
0:第0列特征，-2:是相对位置。

# Unigram
U00:%x[-2,0]
U01:%x[-1,0]
U02:%x[0,0]
U03:%x[1,0]
U04:%x[2,0]
U05:%x[-2,0]/%x[-1,0]/%x[0,0]
U06:%x[-1,0]/%x[0,0]/%x[1,0]
U07:%x[0,0]/%x[1,0]/%x[2,0]
U08:%x[-1,0]/%x[0,0]
U09:%x[0,0]/%x[1,0]
 
# Bigram
B
"""

# 写几个解析后的
"""
# 假设都是对当前词有影响。即X对Y_t有影响。
"""
feature = {
    'U00': (-1,),
    'U01': (0,),
    'U02': (1,),
    'U03': (-1, 0),
    'U04': (-1, 1),
    'U05': (0, 1),
    'U06': (-1, 0, 1),
}
